# Visible Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonPanel..::..Visible Property
RibbonPanel Class See Also
---
Gets or sets a value indicating whether the RibbonPanel is displayed.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Visible { get; set; }
```

Visual Basic
---
```text
Public Property Visible As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Visible {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if the RibbonPanel is displayed; otherwise, false. The default is true.
# See Also
RibbonPanel Class
Autodesk.Revit.UI Namespace